In [1]:
import pandas as pd

In [2]:
ser = pd.Series([100,200,300,400,500], index=['tom','bob','nancy','dan','eric'])

In [3]:
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [4]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [5]:
print(ser['nancy'])

300

In [6]:
ser.loc[['eric','tom']]

eric    500
tom     100
dtype: int64

In [7]:
ser.iloc[[4,3,1]]

eric    500
dan     400
bob     200
dtype: int64

In [8]:
'dan' in ser

True

In [9]:
ser * 2

tom       200
bob       400
nancy     600
dan       800
eric     1000
dtype: int64

In [10]:
ser[['nancy','eric']] * 2

nancy     600
eric     1000
dtype: int64

In [11]:
ser

tom      100
bob      200
nancy    300
dan      400
eric     500
dtype: int64

In [12]:
d = {'one' : pd.Series([100., 200., 300.], index=['apple', 'ball', 'clock']),
     'two' : pd.Series([111., 222., 333., 4444.], index=['apple', 'ball', 'cerill', 'dancy'])}

In [13]:
df = pd.DataFrame(d)
df

          one     two
apple   100.0   111.0
ball    200.0   222.0
cerill    NaN   333.0
clock   300.0     NaN
dancy     NaN  4444.0

In [14]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [15]:
df.columns

Index(['one', 'two'], dtype='object')

In [16]:
df = pd.DataFrame(d, columns=['one','two', 'five'])

In [17]:
df

          one     two five
apple   100.0   111.0  NaN
ball    200.0   222.0  NaN
cerill    NaN   333.0  NaN
clock   300.0     NaN  NaN
dancy     NaN  4444.0  NaN

In [18]:
data = [{'alex': 1, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]

In [19]:
data

[{'alex': 1, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]

In [20]:
pd.DataFrame(data, index=['orange','red'])

        alex  joe  ema  dora  alice
orange   1.0  2.0  NaN   NaN    NaN
red      NaN  NaN  5.0  10.0   20.0

In [21]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

In [22]:
df['three'] = df['one'] * df['two']
df

          one     two five    three
apple   100.0   111.0  NaN  11100.0
ball    200.0   222.0  NaN  44400.0
cerill    NaN   333.0  NaN      NaN
clock   300.0     NaN  NaN      NaN
dancy     NaN  4444.0  NaN      NaN

In [23]:
df['flag'] = df['one'] > 250

In [24]:
df

          one     two five    three   flag
apple   100.0   111.0  NaN  11100.0  False
ball    200.0   222.0  NaN  44400.0  False
cerill    NaN   333.0  NaN      NaN  False
clock   300.0     NaN  NaN      NaN   True
dancy     NaN  4444.0  NaN      NaN  False

In [25]:
three = df.pop('three')

In [26]:
three

apple     11100.0
ball      44400.0
cerill        NaN
clock         NaN
dancy         NaN
Name: three, dtype: float64

In [27]:
del df['five']

In [28]:
df

          one     two   flag
apple   100.0   111.0  False
ball    200.0   222.0  False
cerill    NaN   333.0  False
clock   300.0     NaN   True
dancy     NaN  4444.0  False

In [30]:
movies = pd.read_csv('/Learning/EdX San Diego/Week-4-Pandas/movielens/movies.csv', sep='::')
print(type(movies))
movies.head()

<class 'pandas.core.frame.DataFrame'>

/var/folders/kn/24kjgmss2yzfjngp_zf6x8vr0000gn/T/ipykernel_2108/1417181182.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_csv('/Users/guywinfield/PycharmProjects/Data-Science-Projects/EdX San Diego/Week-4-Pandas/movielens/movies.csv', sep='::')

,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
0,2,Jumanji (1995),Adventure|Children|Fantasy
1,3,Grumpier Old Men (1995),Comedy|Romance
2,4,Waiting to Exhale (1995),Comedy|Drama|Romance
3,5,Father of the Bride Part II (1995),Comedy
4,6,Heat (1995),Action|Crime|Thriller

In [31]:
# Timestamps represent seconds since midnight Coordinated Universal Time (UTC) of January 1, 1970

tags = pd.read_csv('/Learning/EdX San Diego/Week-4-Pandas/movielens/tags.csv', sep='::')
tags.rename(columns={'1': 'unknown', '122': 'movie_id', '5': 'rating', '838985046': 'timestamp'}, inplace=True)
tags.head()

/var/folders/kn/24kjgmss2yzfjngp_zf6x8vr0000gn/T/ipykernel_2108/3576676790.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  tags = pd.read_csv('/Users/guywinfield/PycharmProjects/Data-Science-Projects/EdX San Diego/Week-4-Pandas/movielens/tags.csv', sep='::')

   15  4973       excellent!  1215184630
0  20  1747         politics  1188263867
1  20  1747           satire  1188263867
2  20  2424  chick flick 212  1188263835
3  20  2424            hanks  1188263835
4  20  2424             ryan  1188263835

In [56]:
ratings_raw = pd.read_csv('/Learning/EdX San Diego/Week-4-Pandas/movielens/ratings.csv', sep='::')
ratings_raw.head()

/var/folders/kn/24kjgmss2yzfjngp_zf6x8vr0000gn/T/ipykernel_2108/2607683310.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  ratings_raw = pd.read_csv('/Users/guywinfield/PycharmProjects/Data-Science-Projects/EdX San Diego/Week-4-Pandas/movielens/ratings.csv', sep='::')

   1  122    5  838985046
0  1  185  5.0  838983525
1  1  231  5.0  838983392
2  1  292  5.0  838983421
3  1  316  5.0  838983392
4  1  329  5.0  838983392

In [57]:
ratings_raw = ratings_raw.loc[:5000000]

In [61]:
ratings = ratings_raw.copy()

In [62]:
ratings.rename(columns={'1': 'unknown', '122': 'movie_id', '5': 'rating', '838985046': 'timestamp'}, inplace=True)
del ratings['unknown']

In [64]:
ratings['timestamp'] = pd.to_datetime(ratings['timestamp'], unit='s')

In [65]:
ratings.head()

   movie_id  rating           timestamp
0       185     5.0 1996-08-02 10:58:45
1       231     5.0 1996-08-02 10:56:32
2       292     5.0 1996-08-02 10:57:01
3       316     5.0 1996-08-02 10:56:32
4       329     5.0 1996-08-02 10:56:32

In [66]:
ratings.rating.value_counts()

rating
4.0    1430169
3.0    1179728
5.0     763402
3.5     447896
2.0     396181
4.5     291947
1.0     192337
2.5     189709
1.5      60359
0.5      48273
Name: count, dtype: int64

In [67]:
ratings.head()

   movie_id  rating           timestamp
0       185     5.0 1996-08-02 10:58:45
1       231     5.0 1996-08-02 10:56:32
2       292     5.0 1996-08-02 10:57:01
3       316     5.0 1996-08-02 10:56:32
4       329     5.0 1996-08-02 10:56:32

In [68]:
# For current analysis, we will remove timestamp (we will come back to it!)

del ratings['timestamp']
del tags['timestamp']

KeyError: 'timestamp'